app/Controllers/user.php

    public function index()
    {
        $userModel = new \App\Models\UserModel();
        $data['users'] = $userModel->findAll();
---
SELECT *
FROM `tbl_users`